Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_system/health_services_and_visitors_to_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Health services for visitors to Ireland
ga: Seirbhísí sláinte do chuairteoirí go hÉirinn

source: Certain visitors may be entitled to free public health services
ga: D’fhéadfadh cuairteoirí áirithe a bheith i dteideal seirbhísí sláinte poiblí saor in aisce

source: In particular, people from other European Union (EU) or European Economic Area (EEA) member states or Switzerland who are visiting Ireland temporarily (for example, on holiday or on business) are entitled to medical care if they become ill or have an accident
ga: Go háirithe, tá daoine ó bhallstáit den Aontas Eorpach (AE), den Limistéar Eorpach Eacnamaíoch (LEE) nó ón Eilvéis atá ar cuairt ar Éirinn go sealadach (mar shampla, ar laethanta saoire nó i mbun gnó) i dteideal cúraim shláinte má éiríonn siad tinn nó má tharlaíonn timpiste dóibh

source: Some categories of people are entitled to medical cards under EU rules
ga: Tá roinnt catagóirí daoine i dteideal cártaí leighis faoi rialacha an AE

source: Ireland and Australia have a reciprocal health agreement
ga: Tá comhaontú cómhalartach sláinte idir Éirinn agus an Astráil

source: This means that Australian visitors to Ireland are entitled to receive emergency public hospital treatment subject to the normal charges for non-medical card holders in Ireland
ga: Ciallaíonn seo go bhfuil muintir na hAstráile a thugann cuairt ar Éirinn i dteideal cóireáil éigeandála in ospidéal poiblí a fháil faoi réir na ngnáthmhuirear a ghearrtar in Éirinn ar dhaoine nach bhfuil cárta leighis acu

source: They are also entitled to assistance towards the cost of prescribed drugs and medicines on the same basis as people normally resident in Ireland
ga: Chomh maith leis sin, bíonn siad i dteideal cúnamh a fháil i dtreo costas drugaí agus cógais ordaithe ar an mbonn céanna a bhíonn iad siúd a bhfuil gnáthchónaí orthu in Éirinn

source: People who come to live, work or study in Ireland for a longer period or who retire to Ireland are likely to be regarded as living here (ordinarily resident is the legal term) and to come under the rules as described in Entitlement to health services and medical cards
ga: Is cosúil go nglacfar leis go bhfuil daoine eile a thagann go hÉirinn le cónaí, obair nó staidéar nó a thagann anseo agus iad ar scor ina gcónaí anseo ("cónaitheach de ghnáth" is ea an téarma dlí) agus go dtiocfaidh siad faoi na rialacha mar a leagtar amach iad i dTeidlíocht do Sheirbhísí Sláinte Poiblí agus Cártaí Leighis

source: Other visitors to Ireland are not entitled to avail of free or subsidised public health services except in cases of hardship
ga: Níl cuairteoirí eile go hÉirinn i dteideal seirbhísí sláinte poiblí saor nó fóirdheonaithe ach amháin i gcás an anró

source: In general, if they have to use health services, they must pay the full economic cost of those services
ga: De ghnáth, má tá orthu seirbhísí sláinte a úsáid, caithfidh siad costas eacnamaíoch iomlán na seirbhísí sin a íoc

source: Your entitlement to health services is mainly based on residency and means, rather than on your payment of tax or Pay Related Social Insurance (PRSI)
ga: Tá do theidlíocht do sheirbhísí sláinte in Éirinn bunaithe ar chónaí agus ar acmhainní, seachas ar do cháin nó Árachas Sóisialach Pá-Choibhneasa (ÁSPC) a bheith íoctha

source: There are, however, some exceptions and these are described below
ga: Déantar roinnt eisceachtaí agus tugtar eolas futhu siúd thíos

source: Your nationality, in itself, does not determine your entitlement but there are specific rules covering EU/EEA nationals and Swiss nationals
ga: Níl do theidlíocht ag brath ar do náisiúntacht inti féin, ach clúdaíonn rialacha ar leith saoránaigh de chuid an AE/LEE chomh maith le saoránaigh na hEilbhéise

source: If you have an entitlement to healthcare in another EU/EEA member State or Switzerland, you may have an entitlement to healthcare in Ireland under EU rules
ga: Má tá tú i dteideal cúram sláinte i mballstát eile den AE/LEE nó san Eilvéis, d’fhéadfadh go mbeifeá i dteideal cúram sláinte in Éirinn faoi rialacha an Aontais Eorpaigh

source: If you are visiting Ireland temporarily you can apply for a European Health Insurance Card which covers medical care if you become ill or have an accident.You should bring your European Health Insurance Card with you when you are travelling to Ireland
ga: Má tá tú ar cuairt in Éirinn ar bhonn sealadach, is féidir leat iarratas a dhéanamh ar Chárta Eorpach um Árachas Sláinte, rud lena gclúdaítear cúram leighis má éiríonn tú tinn nó má ghortaítear tú de bharr timpiste

source: If you are from the UK you can bring evidence of UK residence instead
ga: Más as an Ríocht Aontaithe tú féadfaidh tú fianaise ar chónaitheacht RA a thabhairt leat in ionad sin

source: Certain categories of people, such as posted workers, are eligible for medical cards under EU rules – see the further information section on medical cards
ga: Tá roinnt catagóirí daoine, ar nós oibrithe ar phostú incháilithe do chártaí leighis faoi rialacha AE – féach an chuid maidir le heolas breise ar chártaí leighis

source: Nationals of countries that are not in the EU, EEA or Switzerland
ga: Saoránaigh ó stáit nach ballstáit iad de chuid an AE/LEE (ach amháin an Eilbhéis)

source: In general, if you are a national of a non-EU or non-EEA country (with the exception of Switzerland), you are regarded as ordinarily resident in Ireland if you can show the HSE that you intend to live here for at least a year
ga: Go ginearálta, más saoránach stáit tú nach ballstát é de chuid an AE nó an LEE (ach amháin an Eilbhéis), glactar leat mar dhuine atá cónaitheach de ghnáth in Éirinn más féidir leat dearbhú don bhord sláinte go mbeidh tú anseo go ceann bliana ar a laghad

source: The HSE may look for evidence that you are legally entitled to live here for at least a year
ga: Is féidir leis an mbord sláinte fianaise a lorg uait a thaispeánann go bhfuil tú i dteideal de réir dlí cur fút anseo go ceann bliana ar a laghad

source: If you are here for a shorter period, you are regarded as a visitor and you do not have any entitlement to free or subsidised health services. You may wish to consider taking out travel insurance
ga: Má tá tú anseo ar feadh tréimhse giorra, tuigtear gur cuairteoir tú agus níl aon teidlíocht agat do sheirbhísí saor in aisce ná do sheirbhísí sláinte fóirdheonaithe

source: If you are a dependant of someone who is not a EU, EEA or Swiss national, the same rules about ordinary residence apply to you
ga: Más cleithiúnaí tú de shaoránach ó stát nach ballstát é den AE/LEE nó nach saoránach Eilbhíseach é/í, baineann na rialacha céanna maidir le gnáth chónaí leat

source: In other words, the fact that someone who is not a EU, EEA, or Swiss national has established eligibility for health services here does not mean that their non-resident dependants are also entitled to health services in Ireland
ga: Is é sin le rá, má éiríonn le saoránach ó stát nach ballstát é den AE/LEE nó nach saoránach Eilbhíseach é/í a léiriú go bhfuil sé/sí i dteideal seirbhísí sláinte anseo, ní chiallaíonn sin go bhfuil cleithiúnaithe neamh-cónaitheacha i dteideal seirbhísí sláinte in Éirinn freisin

source: Students from countries that are not in the EU, EEA or Switzerland
ga: Mic léinn ó stáit nach ballstáit iad de chuid an AE/LEE (ach amháin an Eilbhéis)

source: If you are a student from a non-EU or non-EEA country (with the exception of Switzerland), you are generally regarded as ordinarily resident if you are registered for a course of study that will last for at least one academic year
ga: Más mac léinn tú ó stát nach ballstát é de chuid an AE nó an LEE (ach amháin an Eilbhéis), glactar leat mar dhuine atá cónaitheach de ghnáth in Éirinn má tá tú cláraithe ar chúrsa a leanfaidh ar aghaidh go ceann bliana acadúla amháin ar a laghad

source: If you are here for a shorter period, you are regarded as a visitor and you do not have any entitlement to free or subsidised health services
ga: Má tá tú anseo do thréimhse níos giorra, glactar leat mar chuairteoir agus níl tú i dteideal seirbhísí sláinte saor in aisce nó fóirdheontaithe

source: Asylum seekers and refugees
ga: Iarrthóirí tearmainn agus dídeanaithe

source: Asylum seekers are given medical cards for the period during which their application for refugee status is being considered
ga: Tugtar cártaí leighis do iarrthóirí tearmainn don tréimhse nuair atá a n-iarratas ar stádas dídine á mheasúnú

source: If you get refugee status, then you are regarded as ordinarily resident and you come under the usual rules for entitlement to health services
ga: Má thugtar stádas dídine duit, glactar leat mar dhuine atá cónaitheach de ghnáth, agus baineann na gnáth rialacha maidir le teidlíocht do sheirbhísí sláinte leat

source: Irish nationals who have been living outside Ireland
ga: Saoránaigh Éireannacha a bhí ina gcónaí taobh amuigh d'Éire

source: If you come back to live in Ireland and are working or self-employed here or if you intend to stay for a year, then you are ordinarily resident and come under the usual rules
ga: Má fhilleann tú ar Éirinn agus má tá tú ag obair nó má tá tú féin-fhostaithe anseo nó má tá sé ar intinn agat fanacht go ceann bliana, sa chás sin tá tú cónaitheach de ghnáth agus baineann na gnáth rialacha leat

source: If you are not in this situation and you have been living and working in another EU/EEA country or Switzerland, your entitlement to health services when you return is decided under the rules applying to EU nationals
ga: Má tá cúinsí eile i gceist, agus má bhí tú ag cur fút agus ag obair i mballstát eile de chuid an AE/LEE nó san Eilbhéis, meastar do theidlíocht do sheirbhísí sláinte nuair a thagann tú ar ais faoi na rialacha a bhaineann le saoránaigh de chuid an AE

source: If you have been abroad on a short-term contract, you continue to be regarded as ordinarily resident
ga: Má bhí tú thar lear ar chonradh gearrthéarmach, glactar leat mar dhuine atá cónaitheach de ghnáth anseo

source: If you have been resident abroad for a period of up to three years but your Local Health Office of the HSE is satisfied that you did not establish an entitlement to health services in any other country, the HSE should regard you as ordinarily resident in Ireland if you require treatment when you return to Ireland
ga: Má bhí tú i do chónaí thar lear ar feadh tréimhse suas go dtí trí bliana ach má tá d'Oifig Sláinte Áitiúil na FSS sásta nár chuir tú isteach ar theidlíocht do sheirbhísí sláinte in aon stát eile, ba chóir go nglacfadh an FSS leat mar dhuine atá cónaitheach de ghnáth in Éirinn má tá cóireáil ag teastáil uait nuair a thagann tú ar ais go hÉirinn

source: This is so that people who emigrate from Ireland do not lose their health service eligibility on residence grounds before they have a chance to establish eligibility elsewhere
ga: Tá seo tábhachtach, óir deimhníonn sé nach gcailleann eisimircigh ó Éirinn a dteidlíocht do sheirbhísí sláinte ar bhonn cónaithe sula mbeidh an deis acu teidlíocht a fháil in aon áit eile

source: This provision does not apply where someone is covered by EU regulations in another country and, in particular, it would not entitle a person temporarily resident in another EU country to have the HSE extend the European Health Insurance Card beyond the normal period
ga: Níl aon fheidhm ag an bhforáil seo sa chás go bhfuil duine clúdaithe faoi rialacha an AE i stát eile, agus ní ligfeadh sé ach go háirithe do dhuine ag cur faoi go sealadach i stát eile de chuid an AE iarradh ar an FSS an Cárta Eorpach Árachas Sláinte a leathnú thar an gnáth-thréimhse

source: People who are not entitled to free health services
ga: Daoine nach bhfuil i dteideal seirbhísí sláinte saor in aisce

source: If you are not ordinarily resident and you are not entitled to health care under any of the circumstances described above, the HSE may apply the full economic cost for any services provided. In cases of hardship the HSE may provide urgent necessary treatment at a reduced charge or without charge
ga: Muna bhfuil tú cónaitheach de ghnáth agus muna gclúdaítear tú faoi na ceannteidil thuasluaite, is féidir leis an FSS luach iomlán na seirbhísí a ghearradh nó cóireáil phráinneach a chur ar fáil ar tháillí laghdaithe nó gan aon táillí i gcruachás
